#Intro to Dataframes

In [ ]:
import pandas as pd
df=pd.DataFrame([[1,2,3],[4,5,6],[7,8,9]],index=["x","y","z"],columns=["a","b","c"])

In [ ]:
df.head()

   a  b  c
x  1  2  3
y  4  5  6
z  7  8  9

In [ ]:
df.columns.tolist()

['a', 'b', 'c']

In [ ]:
df.index.tolist()

['x', 'y', 'z']

In [ ]:
df.info()

<class 'pandas.core.frame.DataFrame'>
Index: 3 entries, x to z
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   a       3 non-null      int64
 1   b       3 non-null      int64
 2   c       3 non-null      int64
dtypes: int64(3)
memory usage: 96.0+ bytes

In [ ]:
df.describe()

         a    b    c
count  3.0  3.0  3.0
mean   4.0  5.0  6.0
std    3.0  3.0  3.0
min    1.0  2.0  3.0
25%    2.5  3.5  4.5
50%    4.0  5.0  6.0
75%    5.5  6.5  7.5
max    7.0  8.0  9.0

In [ ]:
df.nunique()

a    3
b    3
c    3
dtype: int64

 **OLYMPIC DATASET**

In [ ]:
df=pd.read_csv("../datasets/athlete_events.csv") #in vscode dataset/athelete.csv
df.head()

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
0,1,A Dijiang,M,24.0,180.0,80.0,China,CHN,1992 Summer,1992,Summer,Barcelona,Basketball,Basketball Men's Basketball,NaN
1,2,A Lamusi,M,23.0,170.0,60.0,China,CHN,2012 Summer,2012,Summer,London,Judo,Judo Men's Extra-Lightweight,NaN
2,3,Gunnar Nielsen Aaby,M,24.0,NaN,NaN,Denmark,DEN,1920 Summer,1920,Summer,Antwerpen,Football,Football Men's Football,NaN
3,4,Edgar Lindenau Aabye,M,34.0,NaN,NaN,Denmark/Sweden,DEN,1900 Summer,1900,Summer,Paris,Tug-Of-War,Tug-Of-War Men's Tug-Of-War,Gold
4,5,Christine Jacoba Aaftink,F,21.0,185.0,82.0,Netherlands,NED,1988 Winter,1988,Winter,Calgary,Speed Skating,Speed Skating Women's 500 metres,NaN

**Accesing Data**

In [ ]:
df.sample(10)

,ID,Name,Sex,Age,Height,Weight,Team,NOC,Games,Year,Season,City,Sport,Event,Medal
246125,123249,Torsten Elis Ullman,M,43.0,187.0,88.0,Sweden,SWE,1952 Summer,1952,Summer,Helsinki,Shooting,"Shooting Men's Free Pistol, 50 metres",NaN
106229,53738,Bohumil Janouek,M,27.0,182.0,83.0,Czechoslovakia,TCH,1964 Summer,1964,Summer,Tokyo,Rowing,Rowing Men's Coxed Eights,Bronze
160607,80582,Fumiharu Miyamoto,M,19.0,174.0,74.0,Japan,JPN,1988 Summer,1988,Summer,Seoul,Cycling,"Cycling Men's Team Pursuit, 4,000 metres",NaN
160638,80602,Miyo Miyashita,F,21.0,NaN,NaN,Japan,JPN,1952 Summer,1952,Summer,Helsinki,Athletics,Athletics Women's 80 metres Hurdles,NaN
167881,84351,Minoru Nakano,M,27.0,NaN,NaN,Japan,JPN,1964 Winter,1964,Winter,Innsbruck,Ice Hockey,Ice Hockey Men's Ice Hockey,NaN
231559,116172,Bnyamin Suda,M,32.0,176.0,105.0,Turkey,TUR,2008 Summer,2008,Summer,Beijing,Weightlifting,Weightlifting Men's Heavyweight,NaN
44429,22913,Coone,M,NaN,NaN,NaN,France,FRA,1900 Summer,1900,Summer,Paris,Gymnastics,Gymnastics Men's Individual All-Around,NaN
43703,22534,Vctor Colon Ortz,M,20.0,170.0,66.0,Puerto Rico,PUR,1992 Summer,1992,Summer,Barcelona,Gymnastics,Gymnastics Men's Pommelled Horse,NaN
230253,115574,Desislava Stoyanova,F,21.0,169.0,59.0,Bulgaria,BUL,2014 Winter,2014,Winter,Sochi,Biathlon,Biathlon Women's 15 kilometres,NaN
43921,22641,Santo Condorelli,M,21.0,188.0,88.0,Canada,CAN,2016 Summer,2016,Summer,Rio de Janeiro,Swimming,Swimming Men's 50 metres Freestyle,NaN

In [ ]:
df.loc[62449]

ID                          31980
Name             Amro El-Geioushy
Sex                             M
Age                          25.0
Height                        NaN
Weight                        NaN
Team                        Egypt
NOC                           EGY
Games                 1996 Summer
Year                         1996
Season                     Summer
City                      Atlanta
Sport                    Handball
Event     Handball Men's Handball
Medal                         NaN
Name: 62449, dtype: object

In [ ]:
df.iloc[0] #first row

ID                                  1
Name                        A Dijiang
Sex                                 M
Age                              24.0
Height                          180.0
Weight                           80.0
Team                            China
NOC                               CHN
Games                     1992 Summer
Year                             1992
Season                         Summer
City                        Barcelona
Sport                      Basketball
Event     Basketball Men's Basketball
Medal                             NaN
Name: 0, dtype: object

In [ ]:
print(df.iloc[5:8, 1:2].to_string(index=False))

                    Name
Christine Jacoba Aaftink
Christine Jacoba Aaftink
Christine Jacoba Aaftink

In [ ]:
df.columns

Index(['ID', 'Name', 'Sex', 'Age', 'Height', 'Weight', 'Team', 'NOC', 'Games',
       'Year', 'Season', 'City', 'Sport', 'Event', 'Medal'],
      dtype='object')

**Filtering Data**

In [ ]:
df=pd.read_csv("../datasets/bios.csv")
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 145500 entries, 0 to 145499
Data columns (total 10 columns):
 #   Column        Non-Null Count   Dtype
---  ------        --------------   -----
 0   athlete_id    145500 non-null  int64
 1   name          145500 non-null  object
 2   born_date     143693 non-null  object
 3   born_city     110908 non-null  object
 4   born_region   110908 non-null  object
 5   born_country  110908 non-null  object
 6   NOC           145499 non-null  object
 7   height_cm     106651 non-null  float64
 8   weight_kg     102070 non-null  float64
 9   died_date     33940 non-null   object
dtypes: float64(2), int64(1), object(7)
memory usage: 11.1+ MB

In [ ]:
df.loc[df['height_cm']>215,["name","height_cm"]]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

In [ ]:
df[df["height_cm"] > 215][["name", "height_cm"]]

                         name  height_cm
5089       Viktor Pankrashkin      220.0
5583     Paulinho Villas Boas      217.0
5673           Gunther Behnke      221.0
5716                 Uwe Blab      218.0
5781           Tommy Burleson      223.0
5796            Andy Campbell      218.0
6223              Lars Hansen      216.0
6270              Hu Zhangbao      216.0
6409         Sergey Kovalenko      216.0
6420            Jānis Krūmiņš      218.0
6504              Luc Longley      220.0
6722         Shaquille O'Neal      216.0
6937           David Robinson      216.0
6978          Arvydas Sabonis      223.0
7074           Paulo da Silva      217.0
7188       Vladimir Tkachenko      220.0
7281         Stojko Vranković      217.0
7376      Eurelijus Žukauskas      218.0
52608         Aleksey Kazakov      217.0
82100           Frédéric Weis      218.0
89070                Yao Ming      226.0
89075          Roberto Dueñas      221.0
107408       Peter John Ramos      219.0
112312           Stanko Barać      217.0
112332    Andreas Glyniadakis      216.0
112337          Hamed Haddadi      218.0
118663         Timofey Mozgov      216.0
118676        Dmitry Musersky      219.0
120266           Zhang Zhaoxu      221.0
121694            Salah Mejri      216.0
123850         Tyson Chandler      216.0
130460               Li Muhao      218.0
130461                Zhou Qi      217.0
138671          Ondřej Balvín      216.0
139365         Moustapha Fall      218.0

**Add and remove columns**

In [ ]:
df["bmi"] = (df["weight_kg"] / df["height_cm"] / 100) ** 2

In [ ]:
df[["name","bmi"]].sample(5)

                           name       bmi
94266                  Wang Hui  0.000011
44577          Alicia Barrancos       NaN
90081              Eloise Smith       NaN
39137               Leonel Rêgo       NaN
2869   Juan Francisco Rodríguez  0.000012

**Merging and Concatenate**

In [ ]:
noc= pd.read_csv("../datasets/noc_regions.csv")
noc_copy = noc.copy()
noc.to_csv("../datasets/noc_regions_backup.csv", index=False)
noc.head()

   NOC       region                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

In [ ]:
pd.merge(df, noc_copy)

Empty DataFrame
Columns: [athlete_id, name, born_date, born_city, born_region, born_country, NOC, height_cm, weight_kg, died_date, bmi, region, notes]
Index: []

In [ ]:
noc_copy.rename(columns={"region": "noc"}, inplace=True)
noc_copy.head()

   NOC          noc                 notes
0  AFG  Afghanistan                   NaN
1  AHO      Curacao  Netherlands Antilles
2  ALB      Albania                   NaN
3  ALG      Algeria                   NaN
4  AND      Andorra                   NaN

**Handling Null Values**

In [ ]:
df.isnull().sum()

athlete_id           0
name                 0
born_date         1807
born_city        34592
born_region      34592
born_country     34592
NOC                  1
height_cm        38849
weight_kg        43430
died_date       111560
bmi              43430
dtype: int64

In [ ]:
df['height_cm'] = df['height_cm'].fillna(df['height_cm'].mean())

In [ ]:
df["height_cm"].isnull().sum()

np.int64(0)

In [ ]:
df.isnull().sum()

athlete_id           0
name                 0
born_date         1807
born_city        34592
born_region      34592
born_country     34592
NOC                  1
height_cm            0
weight_kg        43430
died_date       111560
bmi              43430
dtype: int64

In [ ]:
df.dropna(subset=["born_date"], inplace=True)
df.isnull().sum()

athlete_id           0
name                 0
born_date            0
born_city        32848
born_region      32848
born_country     32848
NOC                  1
height_cm            0
weight_kg        41716
died_date       109846
bmi              41716
dtype: int64

**Aggregation**

In [ ]:
df['born_city'].value_counts()

born_city
Budapest               1378
Moskva (Moscow)         883
Oslo                    708
Stockholm               629
Praha (Prague)          600
                       ...
Pelham                    1
Williamsville             1
Grosse Pointe Woods       1
Mount Shasta              1
McHenry                   1
Name: count, Length: 22362, dtype: int64

In [ ]:
df[df['born_country']=='USA']['born_region'].value_counts()

born_region
California              1634
New York                 990
Illinois                 585
Massachusetts            530
Pennsylvania             530
New Jersey               381
Texas                    368
Minnesota                365
Ohio                     328
Michigan                 319
Washington               240
Florida                  235
Wisconsin                209
Colorado                 207
Connecticut              156
Indiana                  150
Oregon                   132
Georgia                  129
Virginia                 121
Maryland                 117
District of Columbia     107
Iowa                     102
Hawaiʻi                   95
Kansas                    94
Oklahoma                  93
Louisiana                 92
Utah                      91
Missouri                  91
North Carolina            86
Arizona                   83
New Hampshire             83
Vermont                   68
Mississippi               66
Alabama                   64
Kentucky                  62
Tennessee                 62
Nebraska                  60
Rhode Island              56
Montana                   55
Maine                     50
South Carolina            50
Alaska                    45
Arkansas                  42
Idaho                     41
New Mexico                38
Nevada                    36
South Dakota              27
West Virginia             24
Delaware                  22
North Dakota              16
Wyoming                   14
Name: count, dtype: int64

In [ ]:
# Calculate BMI for each row
df['bmi'] = df['weight_kg'] / (df['height_cm']/100)**2

# Group by weight and height, then get average BMI or count
df.groupby(['weight_kg', 'height_cm'])['bmi'].mean().reset_index()

      weight_kg  height_cm        bmi
0          25.0      135.0  13.717421
1          28.0      137.0  14.918216
2          28.0      141.0  14.083799
3          28.0      142.0  13.886134
4          30.0      136.0  16.219723
...         ...        ...        ...
3563      178.0      187.0  50.902228
3564      180.0      187.0  51.474163
3565      182.0      196.0  47.376093
3566      190.0      200.0  47.500000
3567      198.0      200.0  49.500000

[3568 rows x 3 columns]

In [ ]:
df.groupby(['born_country']).agg({'height_cm': 'mean'})

               height_cm
born_country
AFG           170.653349
AGU           181.166862
ALB           174.918579
ALG           176.457707
AND           172.783847
...                  ...
VIN           179.375147
Vienna        174.879072
YEM           169.000000
ZAM           173.781323
ZIM           173.722767

[236 rows x 1 columns]

In [ ]:
df['new_height']=df['height_cm'].shift(2)
df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,bmi,new_height
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,176.333724,NaN,1960-10-02,NaN,NaN
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.000000,76.0,NaN,22.694019,NaN
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.000000,76.0,1994-07-17,22.694019,176.333724
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.000000,64.0,1978-03-20,22.675737,183.000000
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,176.333724,NaN,1930-07-25,NaN,183.000000

In [ ]:
df['height_rank']=df['height_cm'].rank(ascending=False)
df.head()

,athlete_id,name,born_date,born_city,born_region,born_country,NOC,height_cm,weight_kg,died_date,bmi,new_height,height_rank
0,1,Jean-François Blanchy,1886-12-12,Bordeaux,Gironde,FRA,France,176.333724,NaN,1960-10-02,NaN,NaN,70896.5
1,2,Arnaud Boetsch,1969-04-01,Meulan,Yvelines,FRA,France,183.000000,76.0,NaN,22.694019,NaN,27592.5
2,3,Jean Borotra,1898-08-13,Biarritz,Pyrénées-Atlantiques,FRA,France,183.000000,76.0,1994-07-17,22.694019,176.333724,27592.5
3,4,Jacques Brugnon,1895-05-11,Paris VIIIe,Paris,FRA,France,168.000000,64.0,1978-03-20,22.675737,183.000000,121049.5
4,5,Albert Canet,1878-04-17,Wandsworth,England,GBR,France,176.333724,NaN,1930-07-25,NaN,183.000000,70896.5